# DataFrames

In [3]:
import pandas as pd
import numpy as np


- Create a dataframe with these details
- ** np.random.randn(5,4) ** as first argument
- ** index = ['A','B','C','D','E'] **
- ** columns= ['F','G','H','I','J'] **

In [4]:
np.random.randn(3,3)

array([[-0.57400925, -0.0518282 ,  0.23629343],
       [-0.30085562, -0.66326717, -0.45483397],
       [-1.18513974,  0.13559758, -0.11839603]])

In [8]:
df = pd.DataFrame(np.random.randn(3,3), index=range(5,8), columns=['F','G','H'])
df

          F         G         H
5  0.403027  0.974853  0.972923
6  0.222781  1.323239 -0.556255
7  1.620191  1.672491 -0.793346

- Create a dictionary of equal length lists and pass it to a DataFrame
- data = { "movieid" : [1,2,3,4,5,6,7,8], "moviename": ["Toy Story (1995)", "Jumanji (1995)","Grumpier Old Men (1995)","Waiting to Exhale (1995)","Father of the Bride Part II (1995)","Heat (1995)","Sabrina (1995)","Tom and Huck (1995)"]}

In [15]:
data = { "movieid" : [1,2,3,4,5,6,7,8], 
        "moviename": ["Toy Story (1995)", "Jumanji (1995)",
                      "Grumpier Old Men (1995)",
                      "Waiting to Exhale (1995)",
                      "Father of the Bride Part II (1995)",
                      "Heat (1995)","Sabrina (1995)",
                      "Tom and Huck (1995)"]}
df = pd.DataFrame(data)
print(df)

   movieid                           moviename
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)
5        6                         Heat (1995)
6        7                      Sabrina (1995)
7        8                 Tom and Huck (1995)

- Add an extra column using the **columns** parameter
- Can assign values to the newly created row using scalar assignment ** data['rating'] = 0 **
- Cool thing is, we can assign a named index series to a newly created row and will update the matching rows !

In [18]:
df['rating']=[9,10,23,24,25,26,27,18]
df

   movieid                           moviename  rating
0        1                    Toy Story (1995)       9
1        2                      Jumanji (1995)      10
2        3             Grumpier Old Men (1995)      23
3        4            Waiting to Exhale (1995)      24
4        5  Father of the Bride Part II (1995)      25
5        6                         Heat (1995)      26
6        7                      Sabrina (1995)      27
7        8                 Tom and Huck (1995)      18

- Name a the columns and the index (rows) just like we did for series **df.index.name ="XYZ" df.columns.name="ABC"**

In [19]:
df.index.name = 'slno'
df.columns.name = 'Movie Data'
df

Movie Data  movieid                           moviename  rating
slno
0                 1                    Toy Story (1995)       9
1                 2                      Jumanji (1995)      10
2                 3             Grumpier Old Men (1995)      23
3                 4            Waiting to Exhale (1995)      24
4                 5  Father of the Bride Part II (1995)      25
5                 6                         Heat (1995)      26
6                 7                      Sabrina (1995)      27
7                 8                 Tom and Huck (1995)      18

## Selection and Indexing

- Various methods to grab data from a DataFrame
- Column values can be used as dictionary keys
- .loc to access by row

- Just get the values df.values
- Check the datatype

In [22]:
df['rating']
row0 = df.loc[1]
row0

Movie Data
movieid                   2
moviename    Jumanji (1995)
rating                   10
Name: 1, dtype: object

----
- As a dictionary ** df['F'] **
- As dot infix notation ** df.W ** (Not very popular)

In [23]:
df['rating']

slno
0     9
1    10
2    23
3    24
4    25
5    26
6    27
7    18
Name: rating, dtype: int64

- Also possible to fetch row based data using df.loc['A'] or df.iloc[1]

In [32]:
df = pd.DataFrame(np.random.randn(3,3), index=['A','B','C'], columns=['F','G','H'])
print(df)
print('-'*60)
print(df.loc['A'])
print('-'*50)
print('-'*50)
print (df.iloc[0])

          F         G         H
A -1.779415 -0.125388  1.054954
B  0.670548 -0.284285 -1.137173
C  1.292504  0.249918 -0.344247
------------------------------------------------------------
F   -1.779415
G   -0.125388
H    1.054954
Name: A, dtype: float64
--------------------------------------------------
--------------------------------------------------
F   -1.779415
G   -0.125388
H    1.054954
Name: A, dtype: float64

- Can also pass a list of column names ** df[['F','G']] **
- Also check the data types of selecting a single column and selecting multiple columns
- When its a series check the name attribute also !

In [35]:
df[['F','G']]

          F         G
A -1.779415 -0.125388
B  0.670548 -0.284285
C  1.292504  0.249918

- Creating a new column through computation
- ** df['new']= df['W'] + df['Y'] **

In [41]:
df['handg'] = df.iloc[:,0].sum()
df

          F         G         H     handg
A -1.779415 -0.125388  1.054954  0.183637
B  0.670548 -0.284285 -1.137173  0.183637
C  1.292504  0.249918 -0.344247  0.183637

- Dropping rows and columns
- rows can be dropped by index
- columns can be dropped by mentioning column name and axis = 1
- there is an inplace parameter that can be passed **inplace=True** to effect a change in the underlying DF

In [44]:
print (df)
df.drop('A')

          F         G         H     handg
A -1.779415 -0.125388  1.054954  0.183637
B  0.670548 -0.284285 -1.137173  0.183637
C  1.292504  0.249918 -0.344247  0.183637

          F         G         H     handg
B  0.670548 -0.284285 -1.137173  0.183637
C  1.292504  0.249918 -0.344247  0.183637

- Selecting subset of rows and columns
- df.loc[['A','B'],['W','Y']]
- df.loc['A','W']

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:
- df > 0
- df[df>0]
- df[df['W']>0]
- df[df['W']>0]['Y']
- df[(df['W']>0) & (df['Y'] > 1)]

For two conditions you can use | and & with parenthesis:

## Working with Index

In [45]:
df

          F         G         H     handg
A -1.779415 -0.125388  1.054954  0.183637
B  0.670548 -0.284285 -1.137173  0.183637
C  1.292504  0.249918 -0.344247  0.183637

- Reset the index using reset_index()

In [49]:
df=df.reset_index()
df

   level_0 index         F         G         H     handg
0        0     A -1.779415 -0.125388  1.054954  0.183637
1        1     B  0.670548 -0.284285 -1.137173  0.183637
2        2     C  1.292504  0.249918 -0.344247  0.183637

- Attach a new index
- Create a list of index labels
- Add the index as a column say 'city'
- use set_index('city')

In [56]:
data = { "movieid" : [2,1,1,4,5,6,7,8], 
        "moviename": ["Toy Story (1995)", "Jumanji (1995)",
                      "Grumpier Old Men (1995)",
                      "Waiting to Exhale (1995)",
                      "Father of the Bride Part II (1995)",
                      "Heat (1995)","Sabrina (1995)",
                      "Tom and Huck (1995)"]}
df = pd.DataFrame(data)
a = df.set_index('moviename')
#a.loc[2]
a

                                    movieid
moviename
Toy Story (1995)                          2
Jumanji (1995)                            1
Grumpier Old Men (1995)                   1
Waiting to Exhale (1995)                  4
Father of the Bride Part II (1995)        5
Heat (1995)                               6
Sabrina (1995)                            7
Tom and Huck (1995)                       8

- reindex. Reindex helps in rearranging the index by providing missing data

In [58]:
df.reindex(columns=['moviename', 'movieid'])

                            moviename  movieid
0                    Toy Story (1995)        2
1                      Jumanji (1995)        1
2             Grumpier Old Men (1995)        1
3            Waiting to Exhale (1995)        4
4  Father of the Bride Part II (1995)        5
5                         Heat (1995)        6
6                      Sabrina (1995)        7
7                 Tom and Huck (1995)        8

In [64]:
import json
json1 = open('example.json')
#print(json1)
db1 = json.load(json1)

In [60]:
db1

{'age': [42, 52, 36, 24, 73],
 'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
 'last_name': ['Miller', 'Jacobson', '.', 'Milner', 'Cooze'],
 'postTestScore': ['25,000', '94,000', 57, 62, 70],
 'preTestScore': [4, 24, 31, '.', '.']}

In [61]:
type(db1)

dict

In [62]:
db1.keys()

dict_keys(['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])

In [65]:
for i in db1['first_name']:
    print(i)
    print(type(i))

Jason
<class 'str'>
Molly
<class 'str'>
Tina
<class 'str'>
Jake
<class 'str'>
Amy
<class 'str'>

In [66]:
df2 = pd.DataFrame(db1)

In [67]:
df2

   age first_name last_name postTestScore preTestScore
0   42      Jason    Miller        25,000            4
1   52      Molly  Jacobson        94,000           24
2   36       Tina         .            57           31
3   24       Jake    Milner            62            .
4   73        Amy     Cooze            70            .

In [68]:
df2.to_csv('example.csv')

In [69]:
df3 = pd.read_csv('example.csv')
df3

   Unnamed: 0  age first_name last_name postTestScore preTestScore
0           0   42      Jason    Miller        25,000            4
1           1   52      Molly  Jacobson        94,000           24
2           2   36       Tina         .            57           31
3           3   24       Jake    Milner            62            .
4           4   73        Amy     Cooze            70            .